# Notes on SQL - Basic

## Examples for reference, tips, Best Practices

Based on the Courses: Introduction to SQL at Pluralsight

Author: Gonçalo Felício  
Date: 03/2022  
Provided by: ISIWAY

Something like a pocketbook to come to for quick references, examples, and tips of best practices, compiled with my own preferences.  
Loosely divided by subject, and with some degree, by the respective modules.

### Introduction

SQL is a declarative language ('translates' questions) used to manipulate sets of data from a relational database (a database that describes data and relations between data).  
The point of SQL is to allow us to answer questions we make to the database.  
Database design is very important because of this. Tables should be setup in a way that lets us ask the questions we need (normalized). This translates into having key columns equal between tables that relate the tables. In a general way, columns should be fixed, and rows incremented when new data is added.

### Basic Commands - CRUD
Create (insert), Read (select), Update (update), Delete (delete)

#### Insert Into 
add one or more rows into a __single tabel__  
We don't need to specify the column with the primary key values, it automaticaly adds these values.  
We also don't want our primary key column to have any meaningful data, only generic generated unique values.

In [ ]:
"""
    INSERT INTO table_name 
        (
        column_name1, 
        column_name2,
        column_name3
        ) 
        VALUES 
        (
        row1value1, 
        row1value2,
        row1value3
        ),
        (
        row2value1, 
        row2value2,
        row2value3
        );
"""

When inserting data the order doens't matter as long as it matches betwwen column list and values list.  
The data in the values must also match the table definitions. Can't add a NULL to a non-nullable column.  
We can also insert several rows in 2 ways. By using multiple values in the `VALUES` clause (seen above), or with a `SELECT` statement (seen below).  
Naturally, the second table values must match the first table definitions.

In [ ]:
"""
    INSERT INTO table_name t
        SELECT 
        *
        FROM table_name2 t2
        WHERE t2.keycolumn > 1;
"""

#### Select 
retrives one or more columns from one or more tables

In [1]:
"""
    SELECT col1, col2, col3, etc 
    FROM table_name;
"""

'\n    SELECT row1, row2, row3, etc \n    FROM table_name\n\n'

The column list is also called the 'Select list'.  
Can use the `DISTINCT` command with `SELECT` to choose only unique values in the related column.
Should always table qualify the column names on the select list and can also shorten these with aliases through the `AS` command, and in the `FROM` command.

In [ ]:
"""
    SELECT DISTINCT t.col1, t.col2, t.col3 AS newcol1, newcol2, newcol3 
    FROM table_name t;
"""

We can also use `SELECT *` to choose all the columns in a table, this is a bad practice by itself, but very good to use in nested queries.  
We should always specify the columns we want to see. Ex: in the innermost SELECT clause of a neste query type.

#### Update
modifies one or more rows in a __single table__.  
It's good to use a `WHERE` clause with the key values to specify which rows are we updating.  
Otherwise the whole column is updated to `rowvalue`

Tip: start with the WHERE clause first

In [ ]:
"""
    UPDATE table_name
        SET 
            column_name1 = rowvalue1,
            column_name2 = rowvalue2,
        WHERE keycolumn = 1;
"""

#### Delete From 
deletes one or more rows from a __single table__ permenantly.  
Also good practice to use a Where command to specify rows, otherwise all the rows are deleted.

Tip: start with the where clause

In [ ]:
"""
    DELETE FROM table_name
        WHERE keycolumn > 10;
"""

#### Where
filter the rows with a boolean expression. Naturally can increase complexity of the expression with logical commands such as `AND` and `OR`.  
Tip: `<>` is not equal to

In [ ]:
"""
    SELECT 
        DISTINCT t.col1, t.col2, t.col3 
        AS newcol1, newcol2, newcol3 
    FROM 
        table_name t
    WHERE 
        newcol1 = 'value1' AND 
        t.col4 = 'value4';
"""

Alongside `WHERE` we can also use other commands such as:  

#### Between
inclusive range of values

In [ ]:
"""
    SELECT 
        DISTINCT t.col1, t.col2, t.col3 
        AS newcol1, newcol2, newcol3 
    FROM 
        table_name t
    WHERE 
        newcol1 BETWEEN 1 AND 20;
"""

#### Like
find in string specific characters - using the wildcard symbol `%`

In [ ]:
"""
    SELECT 
        DISTINCT t.col1, t.col2, t.col3 
        AS newcol1, newcol2, newcol3 
    FROM 
        table_name t
    WHERE 
        newcol2 LIKE '%domestic%';
"""

#### In
a boolean value that checks for belonging in a set. Returns rows where the expression is true.  
Also works with the reverse `Not in`.

In [2]:
"""
    SELECT 
        DISTINCT t.col1, t.col2, t.col3 
        AS newcol1, newcol2, newcol3 
    FROM 
        table_name t
    WHERE newcol2 
    IN ('val1','val2');
"""

"\n    SELECT \n        DISTINCT t.col1, t.col2, t.col3 \n        AS newcol1, newcol2, newcol3 \n    FROM \n        table_name t\n    WHERE newcol2 \n    IN ('val1','val2');\n"

Can also use a subquery as the expression inside the IN clause.  
Here query lists departments' id and name if they have a sale greater than 98

In [ ]:
"""

SELECT
  d.id,
  d.name
FROM departments d
WHERE id IN (SELECT department_id
            FROM sales
            WHERE price > 98)
"""

#### Is null/ is not null
An equality operator for null values - returns rows with null values, or the reverse.

In [ ]:
"""
    SELECT 
        DISTINCT t.col1, t.col2, t.col3 
        AS newcol1, newcol2, newcol3 
    FROM 
        table_name t
    WHERE newcol2 
    IS NULL;
"""

#### Order by
Order the rows by the values in a column, eith ascending or descending.  
Works with numbers and strings (alphabetic order).

In [3]:
"""
    SELECT 
        t.col1, t.col2, t.col3 
        AS newcol1, newcol2, newcol3 
    FROM 
        table_name t
    ORDER BY newcol1 DESC;
"""

'\n    SELECT \n        t.col1, t.col2, t.col3 \n        AS newcol1, newcol2, newcol3 \n    FROM \n        table_name t\n    ORDER BY newcol1 DESC\n'

#### Set functions
Often used with order by these are aggregate functions that return single values.  
`COUNT()`,`MAX`,`MIN`,`SUM`,`AVG` all very self explanatory.  
Count is most common as it counts the number of values in a column, very useful when grouping rows.  
Tip: use with `DISTINCT` to count unique values in a group.

#### COUNT

In [ ]:
"""
    SELECT 
        t.col1, t.col2, COUNT(DISTINCT t.col3) 
        AS newcol1, newcol2, newcol3Count 
    FROM 
        table_name t
    ORDER BY newcol3Count DESC;
"""

We can add a Conditional Set function with the use of CASE statements. For Count use Null, for SUM use 0.

In [ ]:
"""
SELECT
  EXTRACT (MONTH FROM p.payment_date) as month,
  COUNT(p.payment_id) as total_count,
  SUM(p.amount) as total_amount,
  COUNT(CASE 
        WHEN p.staff_id = 1 THEN p.payment_id else NULL END) as mike_count,
  SUM(CASE 
      WHEN p.staff_id = 1 THEN p.amount else 0 END) as mike_amount,
  COUNT(CASE 
        WHEN p.staff_id = 2 THEN p.payment_id else NULL END)  as jon_count,
  SUM(CASE
      WHEN p.staff_id = 2 THEN p.amount else 0 END) as jon_amount
FROM payment p
GROUP BY month
ORDER BY month
;"""

#### SUM

We can sum values in a column and even use OVER (ORDER BY..) to get a cumulative SUM.  
Here we show a date, the number of counts of that date, and a cumulative sum of the counts, over all dates, ordered, meaning consecutively.

In [ ]:
"""
SELECT 
  date, 
  count(date) as count, 
  CAST(SUM(count(date)) OVER (ORDER BY date) as integer) as total

FROM(SELECT 
         CAST(created_at as date) as date 
     FROM posts) as cte
GROUP BY date;
"""

#### MIN, MAX AND MEDIAN
If there is no median function, use expression below.

In [ ]:
"""
SELECT
  MIN(r.score) as min,
  ROUND(PERCENTILE_CONT(0.50) WITHIN GROUP (ORDER BY score)::numeric, 2)::float as median,
  MAX(r.score) as max

FROM result r
"""

#### Group by
aggregates values in a column with equal value.  
Often used with `ORDER BY` and `HAVING`, that act on the groups.  
`HAVING` is the same as `WHERE` but for groups.

In [ ]:
"""
    SELECT 
        t.col1, t.col2, COUNT(t.col3), t.col3
        AS newcol1, newcol2, newcol3Count 
    FROM 
        table_name t
    GROUP BY t.col3
    HAVING newcol3Count > 1
"""

### Join Clauses

Join clauses allow us to join one or more tables by a key argument equal in both tables.  
There are a few different Join types, which to use depends on the necessity.  
Can also do multiple joins, see https://www.sqlshack.com/sql-multiple-joins-for-beginners-with-examples/

#### Inner Join
Most used, returns rows that have matching values between the tables. Does not return NULL values.

In [ ]:
"""
    SELECT 
        t.col1, t.col2, t2.col1
    FROM 
        table_name t
    INNER JOIN table_name t2
    ON t.col1 = t2.col1
"""

#### Left/Right Outer Join
Can handle null values. Will return all the rows in the left-hand table, and those without matches from right-hand table are set to NULL.  
The left-hand table is the one in the FROM statement.

In [ ]:
"""
    SELECT 
        t.col1, t.col2, t2.col1
    FROM 
        table_name t
    LETFT OUTER JOIN table_name t2
    ON t.col1 = t2.col1
"""

#### Self Join
Join a table to itself. This is useful when a table contains hierarchical data and we can relate columns to each other in a join statement.  
Use the same table on left and right side.

#### RANK
It's common to RANK with joins. This is, rank the rows by some descriptor. Can do it like this:  
Here we list id, name and count of sales, and a rank column, also by count of sales. Could also use Partition by to rank several groups as once. In this case, we use id, but that is a primary key, so doesnt change anything.

In [ ]:
"""
SELECT
  p.id,
  p.name,
  COUNT(s.sale) as sale_count,
  RANK () OVER (PARTITION BY p.id ORDER BY COUNT(s.sale) DESC) as sale_rank
FROM people p
  INNER JOIN sales s
  on p.id = s.people_id
GROUP BY p.id
;
"""

## Creating Database and Tables

#### Create Database
creates a new database. We can only have databases with unique names in the same server instance.  
Curiosity - this command is not part of the SQL standard.

In [5]:
"""
CREATE DATABASE database_name;
"""

'\nCREATE DATABASE database_name;\n'

#### Create Table
creates a new table. Must also have a unique name in the database, but can have the same name as other tables in other databases.
When creating a database, be careful with choosing the space alocated to the table. Plan for the future, better to have excess space than to change the database after creation.  
At this step we specify the column name, the type of data, and wether the column is nullable or not (default is nullable).  
Defining the datatype of columns is one of the most important steps, take care!

Tip: if you have a foreign key collumn (a column key that refers to other tables), make sure it is nullable.

In [ ]:
"""
CREATE TABLE table_name
(
    column_name1 INTEGER NOT NULL,
    column_name2 VARCHAR(256),
    column_name3 DATE,
    column_name4 TIME,
    column_name5 TIMESTAMP,
    column_name6 BOOLEAN NOT NULL,
    column_name7 BINARY NOT NULL,
    column_name7 FLOAT NOT NULL,
);
"""

#### Primary keys and Foreign Keys
key columns are columns that we can use to refer to the rows.  
They do not have significant data and have unique values. The primary key must always be NOT NULL. 
We can also declare these definitions with a `CONSTRAINT` statement.

Tip: always declare the constraints as the last step in table creation.

In [ ]:
"""
CREATE TABLE table_name
(
    column_name1 INTEGER NOT NULL,
    column_name2 VARCHAR(256),
    column_name3 DATE,
    column_name4 TIME,
    column_name5 TIMESTAMP,
    column_name6 BOOLEAN NOT NULL,
    column_name7 BINARY NOT NULL,

    CONSTRAINT PK_table_name # name of the constraint, standard for primary key declaration
    PRIMARY KEY (column_name1)
);
"""

#### Alter Table
changes an existing table.  
Can add/remove columns, change data type, change constraints. Naturally, the changes must match the current table in the database.

In [ ]:
"""
ALTER TABLE table_name2
(
    column_name2 INTEGER NULL,
    column_name3 DATE NOT NULL,
   
    ADD CONSTRAINT FK_table_name2 # name of the constraint, standard for foreign key declaration
    FOREIGN KEY (column_name2)
    REFERENCES table_name (column_name1) # table and column that are referenced to this FK
);
"""

#### Drop table
permanently deletes an existing table. BE CAREFUL! removes all the data and the table.
If there is a foreing key to another table, raises an ERROR. We need to delete that table first.

Tip: comment out the Drop table statement and, to run it, highlight and execute just the command

In [6]:
"""
DROP TABLE table_name;
"""

'\nDROP TABLE table_name;\n'

#### CASE..When..Then..Else..End
Case statements allow for conditional results. Can be used in SELECT statements or any other case where we are choosing a column to operate on and want a condition to affect it.

This examples uses two tables with number of heads, arms, legs and tails, and creates a new column of species based on conditions.

In [ ]:
"""
SELECT
  th.id,
  th.heads,
  bh.legs,
  th.arms,
  bh.tails,
  CASE
    WHEN th.heads > th.arms THEN 'BEAST'
    WHEN bh.tails > bh.legs THEN 'BEAST'
    ELSE 'WEIRDO'
  END as species
FROM top_half as th
INNER JOIN bottom_half as bh
  on th.id = bh.id
ORDER BY species
;
"""

#### Union
Union merges two tables by their rows. Naturally, the tables must have same number of columns and same data types.
Union by default uses Distinct, to include duplicates between the tables must use `UNION ALL`

In [1]:
"""
SELECT City, Country FROM Customers
WHERE Country='Germany'
UNION ALL
SELECT City, Country FROM Suppliers
WHERE Country='Germany'
ORDER BY City;
"""

"\nSELECT City, Country FROM Customers\nWHERE Country='Germany'\nUNION ALL\nSELECT City, Country FROM Suppliers\nWHERE Country='Germany'\nORDER BY City;\n"

#### Intersect
Returns the common values between 2 tables (or the same table twice). Can add a WHERE statement to filter results. Must select columns with same data types to match.  
Not as simple as it looks.  
Here lists the film's names if the actor 105 and actor 102 both acted on the film.

In [ ]:
"""
SELECT
  F.title as title
FROM (
  SELECT F1.film_id
  FROM film_actor F1
  WHERE F1.actor_id = 105
  INTERSECT
  SELECT F2.film_id
  FROM film_actor F2
  WHERE F2.actor_id = 122) R, film F
WHERE R.film_id = F.film_id
ORDER BY title
"""

#### Exists
Returns TRUE if a subquery returns one or more record.  
Here lists id and name of table departments if those departments have a sale with price higher than 98.

In [ ]:
"""
SELECT 
  d.id,
  d.name
FROM departments d
WHERE EXISTS(
  SELECT s.name
  FROM sales s
  WHERE d.id = s.department_id
  AND s.price > 98.00
)
"""